Repository: calculquebec/infra-gdr
Catalog: docs/_build/locale/*/LC_MESSAGES/community/contributing.po
Languages: fr

source: Contributing
fr: Contribuer

source: This repository uses [Sphinx](https://www.sphinx-doc.org), a powerful documentation generator, to create high-quality documentation. It enables you to write documentation in reStructuredText (reST) format or markdown (MyST) and provides tools for complex documentation and publishing workflows.
fr: Ce dépôt utilise [Sphinx](https://www.sphinx-doc.org), un puissant générateur de documentation, pour créer une documentation de haute qualité. Il vous permet d'écrire de la documentation au format reStructuredText (reST) ou au format markdown (MyST) et fournit des outils pour des flux de travail complexes de documentation et de publication.

source: Prerequisities
fr: Pré-requis

source: To set up the development environment and build the documentation, follow these steps inside the cloned repository:
fr: Pour configurer l'environnement de développement et générer la documentation, suivez ces étapes à l'intérieur du dépôt cloné:

source: Create a virtual environment
fr: Créer un environnement virtuel

source: Activate the virtual environment
fr: Activer l'environnement virtuel

source: Install the required dependencies
fr: Installer les dépendances requises

source: Building the Documentation
fr: Construire la documentation

source: Since we have to support many languages, a meta build system `docs/build.py` has been added to support internationalized builds for any configured language.
fr: Étant donné que nous devons prendre en charge de nombreuses langues, un système de génération `docs/build.py` a été ajouté pour prendre en charge les génération internationalisées pour toute langue configurée.

source: Therefore, building the documentation is as simple as:
fr: Ainsi, générer la documentation est aussi simple que:

source: Which will produce an **HTML** output in the `public` folder.
fr: Ce qui produira une sortie HTML dans le dossier `public`.

source: Internationalization (i18n)
fr: Internationalisation (i18n)

source: `sphinx-intl` is a utility tool that provides several features that make it easy to translate and to apply translation to **Sphinx** generated document.
fr: sphinx-intl est un outil qui propose plusieurs fonctionnalités facilitant la traduction et l'application de traduction aux documents générés par Sphinx.
