Repository: calculquebec/infra-gdr
Catalog: docs/_build/locale/*/LC_MESSAGES/infra/apps.po
Languages: fr

source: Minimum system requirements:
fr: Configuration système minimale :

source: Hardware: 1 vCPU/core with 2GB RAM (support for up to 1,000 users)
fr: Matériel : 1 vCPU/core avec 2 Go de RAM (prise en charge jusqu'à 1 000 utilisateurs)

source: Database: PostgreSQL v11+
fr: Base de données : PostgreSQL v11+

source: Application ports 80/443, TLS, TCP Inbound
fr: Ports d'application 80/443, TLS, TCP entrant

source: Administrator Console port 8065, TLS, TCP Inbound
fr: Port de la console d'administration 8065, TLS, TCP entrant

source: SMTP port 10025, TCP/UDP Outbound
fr: Port SMTP 10025, TCP/UDP sortant

source: Nextcloud is a powerful and flexible self-hosted cloud storage and collaboration platform that can be used to provide gated services for research groups. These allow controlled access to data and resources within a research group, ensuring the security and privacy of sensitive information.
fr: Nextcloud est une plateforme puissante et flexible auto-hébergée de stockage et collaboration infonuagique qui peut être utilisée pour fournir des services contrôlés pour des groupes de recherche. Cela permet un accès granulaire aux données et aux ressources au sein d'un groupe de recherche, garantissant la sécurité et la confidentialité des informations sensibles.

source: Features and Benefits
fr: Fonctionnalités et avantages

source: **Secure and Private Storage**: Nextcloud offers end-to-end encryption, ensuring that data remains secure and private.
fr: **Stockage sécurisé et privé** : Nextcloud offre un chiffrement de bout en bout, garantissant que les données restent sécurisées et privées.

source: **User Management**: Nextcloud provides robust user management capabilities, allowing to control access to data and resources based on user roles and permissions.
fr: **Gestion des utilisateurs** : Nextcloud propose des fonctionnalités robustes de gestion des utilisateurs, permettant de contrôler l'accès aux données et aux ressources en fonction des rôles et des autorisations des utilisateurs.

source: **Collaboration Tools**: Explore a wide range of collaboration features, such as file sharing, document editing, and shared calendars, enabling seamless collaboration within a research group.
fr: **Outils de collaboration** : Une large gamme de fonctionnalités de collaboration est disponible, telles que le partage de fichiers, l'édition de documents et les calendriers partagés, permettant une collaboration transparente au sein d'un groupe de recherche.

source: **Integration with Research Workflows**: Integrate with various research tools and services, facilitating data sharing, analysis, and collaboration within a research workflow.
fr: **Intégration avec les flux de travaux de recherche** : Intégrez divers outils et services de recherche, facilitant le partage de données, l'analyse et la collaboration au sein d'un flux de travail de recherche.

source: **Gated Services**: The access control feature allows gated access for specific research projects or resources. Only authorized users will have access to these, ensuring data privacy and security.
fr: **Services contrôlés** : La fonction de contrôle d'accès permet un accès contrôlé aux projets de recherche spécifiques ou aux ressources. Seuls les utilisateurs autorisés auront accès à ceux-ci, garantissant la confidentialité et la sécurité des données.

source: Updates
fr: Mises à jour

source: By default, Nextcloud is configured to use the [updatedirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#updatedirectory) setting for storing update files. However, if the [updatedirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#updatedirectory) is not explicitly set, Nextcloud falls back to using the [datadirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#datadirectory) for updates.
fr: Par défaut, Nextcloud est configuré pour utiliser le paramètre [updatedirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#updatedirectory) pour stocker les fichiers de mise à jour. Cependant, si le paramètre [updatedirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#updatedirectory) n'est pas explicitement défini, Nextcloud utilise le paramètre [datadirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#datadirectory) pour les mises à jour.

source: Handling Full Data Partition
fr: En cas de partition de données pleine

source: To avoid such issues, it is recommended to set the [updatedirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#updatedirectory) explicitly to a separate location that has sufficient free space, independent of the [datadirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#datadirectory).
fr: Pour éviter ce genre de problèmes, il est recommandé de définir explicitement le paramètre [updatedirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#updatedirectory) sur un emplacement séparé disposant d'un espace libre suffisant, indépendamment du paramètre [datadirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#datadirectory).

source: Make sure the specified [updatedirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#updatedirectory) exists and is writable by the web server (i.e. `www-data`) user so that Nextcloud can store the update packages in that location.
fr: Assurez-vous que le chemin spécifié par [updatedirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#updatedirectory) existe et peut être écrit par l'utilisateur du serveur web (par exemple, `www-data`), afin que Nextcloud puisse y stocker les paquets de mise à jour.

source: By specifying a dedicated directory for update files, we ensure that updates can be performed even if the data partition is full.
fr: En spécifiant un chemin dédié aux fichiers de mise à jour, nous nous assurons que les mises à jour puissent être effectuées même si la partition des données est pleine.

source: Logging
fr: Journalisation

source: All log information are written to a separate log file.
fr: Toutes les informations de journalisation sont écrites dans un fichier de journal séparé.

source: By default, this file is named `nextcloud.log` and will be created in the directory which has been configured by the [datadirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#datadirectory) parameter in `config/config.php`.
fr: Par défaut, ce fichier est nommé `nextcloud.log` et sera créé dans le répertoire configuré par le paramètre [datadirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#datadirectory) dans le fichier `config/config.php`.

source: Preventing accessibility issues to files
fr: Prévention des problèmes d'accessibilité aux fichiers

source: In certain scenarios, it is advisable to configure the `logfile` key to an absolute location on a separate partition from the [datadirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#datadirectory).
fr: Dans certains scénarios, il est conseillé de configurer la clé `logfile` avec un emplacement absolu sur une partition distincte du [datadirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#datadirectory).

source: A quite standard location is `/var/log/nextcloud.log`.
fr: Un emplacement assez courant est `/var/log/nextcloud.log`.

source: Since the `www-data` user does not have write access within the `/var/log` directory, we need to create the file as follows
fr: Comme l'utilisateur `www-data` n'a pas les droits d'écriture dans le dossier `/var/log`, nous devons créer le fichier de la manière suivante:

source: Then we can configure the `logfile` key within `config/config.php`
fr: Ensuite, nous pouvons configurer la clé `logfile` dans `config/config.php`

source: This configuration can help prevent accessibility issues with the **files** app, which logs accesses to the `logfile` whenever directories or files are read within the [datadirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#datadirectory).
fr: Cette configuration peut aider à prévenir les problèmes d'accessibilité avec l'application **files**, qui consigne les accès au logfile chaque fois que des dossiers ou des fichiers sont lus dans le [datadirectory](https://docs.nextcloud.com/server/latest/admin_manual/configuration_server/config_sample_php_parameters.html#datadirectory).
