Repository: calculquebec/infra-gdr
Catalog: docs/_build/locale/*/LC_MESSAGES/infra/troubleshooting.po
Languages: fr

source: Troubleshooting
fr: Dépannage

source: If you encounter issues with deploying the research data management services, please try the following troubleshooting steps:
fr: Si vous rencontrez des problèmes lors du déploiement des services de gestion des données de recherche, veuillez suivre les étapes de dépannage suivantes:

source: Verify Input Variables
fr: Vérifier les variables d'entrée

source: If you are experiencing issues with deploying the services, it may be because of incorrectly defined input variables. Ensure that all the required input variables have been correctly defined in `variables.tf`. Review the documentation for each input variable and verify that the values provided for them are correct.
fr: Si vous rencontrez des problèmes lors du déploiement des services, cela peut être dû à des variables d'entrée incorrectement définies. Assurez-vous que toutes les variables d'entrée requises ont été correctement définies dans `variables.tf`. Revoyez la documentation pour chaque variable d'entrée et vérifiez que les valeurs qui leur sont attribuées sont correctes.

source: Check Provider Versions
fr: Vérifier les versions du fournisseur

source: Terraform providers have their own versioning and compatibility requirements. Ensure that the required provider versions have been correctly defined in `providers.tf` and `versions.tf`. You can check the documentation for each provider to verify the specific versions required.
fr: Les fournisseurs Terraform ont leurs propres exigences de versionnement et de compatibilité. Assurez-vous que les versions du fournisseur requises ont été correctement définies dans `providers.tf` et `versions.tf`. Vous pouvez consulter la documentation de chaque fournisseur pour vérifier les versions spécifiques requises.

source: Verify Infrastructure Resources
fr: Vérifier les ressources d'infrastructure

source: If the input variables and provider versions have been correctly defined, the next step is to verify that the required infrastructure resources have been correctly defined in `apps.tf`, `databases.tf`, and `firewall.tf`. Check each resource definition and ensure that the configuration is correct.
fr: Si les variables d'entrée et les versions du fournisseur ont été correctement définies, l'étape suivante consiste à vérifier que les ressources d'infrastructure requises ont été correctement définies dans `apps.tf`, `databases.tf` et `firewall.tf`. Vérifiez chaque définition de ressource et assurez-vous que la configuration est correcte.

source: Check Logs and Error Messages
fr: Vérifier les journaux et les messages d'erreur

source: If you are still experiencing issues after trying the above troubleshooting steps, check the logs and error messages for any specific issues or errors that need to be addressed. You can use the `terraform plan` and `terraform apply` commands with the `-debug` flag to get more detailed logging information.
fr: Si vous rencontrez toujours des problèmes après avoir suivi les étapes de dépannage ci-dessus, vérifiez les journaux et les messages d'erreur pour identifier les problèmes ou les erreurs spécifiques qui doivent être résolus. Vous pouvez utiliser les commandes `terraform plan` et `terraform apply` avec l'option `-debug` pour obtenir des informations de journalisation plus détaillées.

source: If you are unable to resolve the issues after reviewing the logs and error messages, consult the Terraform documentation or seek help from the Terraform community forums.
fr: Si vous ne parvenez pas à résoudre les problèmes après avoir examiné les journaux et les messages d'erreur, consultez la documentation Terraform ou demandez de l'aide sur les forums communautaires Terraform.
