Repository: calculquebec/infra-gdr
Catalog: docs/_build/locale/*/LC_MESSAGES/intro/installing.po
Languages: fr

source: Requirements
fr: Requis

source: For deployment purposes, we need access to an OpenStack provider. The provider is responsible for managing the connection between your project and the OpenStack environment.
fr: Pour les déploiements, nous avons besoin d'un accès à un fournisseur OpenStack. Le fournisseur est responsable de la gestion de la connexion entre votre projet et l'environnement OpenStack.

source: Authentication
fr: Authentification

source: To authenticate with an OpenStack provider, you should configure your authentication using [Keystone][#keystone]. We can configure authentication with [Keystone credentials][#keystone_creds] using either the [clouds.yaml][#clouds_yaml] or [environment variables][#envvars].
fr: Pour vous authentifier avec un fournisseur OpenStack, vous devez configurer votre authentification en utilisant [Keystone][#keystone]. Nous pouvons configurer l'authentification avec [les informations d'identification Keystone][#keystone_creds] en utilisant soit le fichier [clouds.yaml][#clouds_yaml] soit les [variables d'environnement][#envvars].

source: The [clouds.yaml][#clouds_yaml] file is used to store your OpenStack configuration information. This file should be located in your home directory under the .config/openstack directory.
fr: Le fichier [clouds.yaml][#clouds_yaml] est utilisé pour stocker les informations de configuration de votre OpenStack. Ce fichier doit être situé dans votre répertoire personnel sous le répertoire .config/openstack.

source: Alternatively, you can configure authentication using [environment variables][#envvars]. This file is typically sourced within your shell environment.
fr: Alternativement, vous pouvez configurer l'authentification en utilisant [les variables d'environnement][#envvars]. Ce fichier est généralement sourcé dans l'environnement de votre terminal.

source: In either case, it is important to ensure that authentication is properly configured so that the OpenStack provider is accessible and secure.
fr: Dans les deux cas, il est important de veiller à ce que l'authentification soit correctement configurée afin que le fournisseur OpenStack soit accessible et sécurisé.

source: Find up-to-date instructions for your operating system on [Install Terraform][#install_terraform]
fr: Trouvez des instructions à jour pour votre système d'exploitation sur [Install Terraform][#install_terraform]

source: Workspaces
fr: Espaces de travail

source: This section requires attention
fr: Cette section nécessite une attention particulière

source: Created and switched to workspace "myworkspace"!
fr: Espace de travail "myworkspace" créé et activé !

source: You're now on a new, empty workspace. Workspaces isolate their state, so if you run "terraform plan" Terraform will not see any existing state for this configuration.
fr: Vous êtes maintenant dans un nouvel espace de travail vide. Les espaces de travail isolent leur état, donc si vous exécutez "terraform plan", Terraform ne verra aucun état existant pour cette configuration.

source: Deployments
fr: Déploiements
