Repository: calculquebec/infra-gdr
Catalog: docs/_build/locale/*/LC_MESSAGES/index.po
Languages: fr

source: ✨ Getting started
fr: ✨ Pour commencer

source: 🫂 Community
fr: 🫂 Communauté

source: This project is aimed at providing an easy-to-use tool for researchers to manage their research data effectively.
fr: Ce projet vise à fournir un outil facile à utiliser pour les chercheurs afin de gérer efficacement leurs données de recherche.

source: Summary
fr: Résumé

source: {doc}`✨ Getting started <intro/installing>`
fr: {doc}`✨ Pour commencer <intro/installing>`

source: This section provides detailed steps to set up and configure the software for your environment.
fr: Cette section fournit des étapes détaillées pour configurer le logiciel dans votre environnement.

source: {doc}`intro/installing`
fr: {doc}`Installation <intro/installing>`

source: This section acts as a comprehensive knowledge base providing in-depth information and resources for various aspects of the system architecture.
fr: Cette section constitue une base de connaissances complète fournissant des informations approfondies et des ressources sur différents aspects de l'architecture système.

source: {doc}`infra/overview`
fr: {doc}`Aperçu <infra/overview>`

source: {doc}`infra/databases`
fr: {doc}`Bases de données <infra/databases>`

source: {doc}`infra/backups`
fr: {doc}`Sauvegardes <infra/backups>`

source: {doc}`infra/security`
fr: {doc}`Sécurité <infra/security>`

source: {doc}`🫂Community <community/contributing>`
fr: {doc}`🫂Communauté <community/contributing>`

source: Join our diverse community of passionate individuals thriving to make a difference !
fr: Rejoignez notre communauté diversifiée de passionnés qui cherchent à faire la différence !

source: Learn how you can contribute to the project and make a meaningful impact or gain insights into the open-source nature of our work and the permissions / restrictions associated with our project's license.
fr: Découvrez comment vous pouvez contribuer au projet et avoir un impact significatif ou acquérir une compréhension de la nature ouverte de notre travail ainsi que des permissions / restrictions associées à la licence de notre projet.

source: {doc}`community/contributing`
fr: {doc}`Contribuer <community/contributing>`

source: Features
fr: Fonctionnalités

source: Easy data organization
fr: Organisation facile des données

source: Automatic backups
fr: Sauvegardes automatiques

source: Highly available database cluster
fr: Agrégat de base de données hautement disponible

source: Contributing
fr: Contribuer

source: Please see the {doc}`contributing <community/contributing>` section for more information.
fr: Veuillez consulter la section {doc}`contribuer <community/contributing>` pour plus d'informations.

source: License
fr: Licence

source: This project is licensed under the [AGPLv3 License](https://www.gnu.org/licenses/agpl-3.0.html) - see the {doc}`license <community/license>` section for details.
fr: Ce projet est sous licence [AGPLv3](https://www.gnu.org/licenses/agpl-3.0.html) - consultez la section {doc}`license <community/license>` pour plus de détails.
